Revit 2027 API
ViewSchedule.CreateSchedule(Document, ElementId) Method
 Creates a regular schedule.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ViewSchedule CreateSchedule(
	Document document,
	ElementId categoryId
)
Public Shared Function CreateSchedule (
	document As Document,
	categoryId As ElementId
) As ViewSchedule
public:
static ViewSchedule^ CreateSchedule(
	Document^ document,
	ElementId^ categoryId
)
static member CreateSchedule :
        document : Document *
        categoryId : ElementId -> ViewSchedule
Parameters
document Document
 The document to which the new schedule will be added.
categoryId ElementId
 The ID of the category whose elements will be included in the schedule, or InvalidElementId for a multi-category schedule.
Return Value
ViewSchedule
 The newly created schedule.
Exceptions
Exception | Condition
ArgumentException |  document is not a project document. -or- categoryId is not a valid category for a regular schedule. -or- The Areas category was specified but an area scheme ID was not provided.
ArgumentNullException |  A non-optional argument was null
ModificationForbiddenException |  The document is in failure mode: an operation has failed, and Revit requires the user to either cancel the operation or fix the problem (usually by deleting certain elements). -or- The document is being loaded, or is in the midst of another sensitive process.
ModificationOutsideTransactionException |  The document has no open transaction.
See Also
Reference
ViewSchedule Class
CreateSchedule Overload
Autodesk.Revit.DB Namespace